"authentication: email" = "Email Address";
"authentication: username" = "Username";
"authentication: password" = "Password";
"authentication: confirm password" = "Confirm Password";

"authentication: submit" = "Submit";
"authentication: register" = "Register";
"authentication: login" = "Sign in";